Repository: Daniel-KM/Omeka-S-module-SearchSolr
Catalog: language/*.po
Languages: fr

source: Only uris matching this regex
fr: Seulement les uris correspondant à cette expression

source: Only linked resources matching this standard query
fr: Seulement les ressources liées correspondant à cette requête standard

source: Exclude data types
fr: Exclure des types de données

source: Select data types to exclude…
fr: Indiquer les types de données à exclure…

source: Only visibility
fr: Seulement la visibilité

source: Solr field
fr: Champ Solr

source: Default alias
fr: Alias par défaut

source: The default alias is optional. Usualy, it is the Omeka search key. More aliases can be configured in the search config page.
fr: L’alias par défaut est facultatif. Généralement, il correspond à la clé de recherche Omeka. Des alias complémentaires peuvent être configurés dans la page de recherche.

source: Default label
fr: Libellé par défaut

source: The label is automatically translated if it exists in Omeka.
fr: Le libellé est automatiquement traduite s’il existe dans Omeka.

source: Boost multiplier
fr: Pondération

source: The boost is set by index, so if the boost is set multiple times, only the value of the last index will be used. Moreover, they can be overridden by the search fields boosts.
fr: La pondération est définie par index et lorsqu’elle est définie plusieurs fois, la dernière est utilisée. De plus, la pondération des champs de recherche peuvent les remplacer.

source: Index for bounce link (for multi-string "_ss")
fr: Index pour les liens rebonds (pour les chaînes multiples "_ss")

source: Values to extract
fr: Valeurs à extraire

source: Full (linked resource label, uri label, uri, and value)
fr: Complet (libellé de la ressource liée, libellé de l’uri, uri et valeur)

source: Single linked resource label, uri label, uri or any extracted value
fr: Libellé de la ressource liée, libellé de l’uri, uri ou tout autre valeur

source: Property values only (as stored in database)
fr: Valeurs des propriétés seules (comme dans la base)

source: Uri (for values with an uri)
fr: Uri (pour les valeurs avec une uri)

source: Id of the linked resource
fr: Id de la ressource liée

source: Id of the resource
fr: Id de la ressource

source: Bounce link (value, uri or linked id)
fr: Lien rebond (valeur, uri ou id de la ressource liée)

source: Html (as seen)
fr: Html (comme affiché)

source: Formatter
fr: Formateur

source: Cleaning and normalization
fr: Nettoyage et normalisation

source: The cleaning is processed in the following order.
fr: Le nettoyage s’effectue dans l’ordre suivant.

source: Escape html
fr: Échapper le html

source: Strip tags
fr: Supprimer les balises html

source: Lower case
fr: Minuscules

source: Upper case
fr: Majuscules

source: Upper case first character
fr: Majuscule pour le premier caractère

source: Remove diacritics
fr: Supprimer les diacritiques

source: Alphanumeric only
fr: Alphanumérique seulement

source: Alphabetic only
fr: Alphabétique seulement

source: Max length
fr: Longueur maximale

source: Year
fr: Année

source: Map value to a code or code to a value (module Table)
fr: Convertir un code en un label ou un label en un code (module Table)

source: Country and toponym separately
fr: Pays et toponyme séparément

source: Toponym and country separately
fr: Toponyme et pays séparément

source: Country and toponym together
fr: Pays et toponyme ensemble

source: Toponym and country together
fr: Toponyme et pays ensemble

source: Toponym
fr: Toponyme

source: Country
fr: Pays

source: Coordinates
fr: Coordonnées

source: String with all data
fr: Chaîne avec toutes les données

source: All data separately
fr: Toutes les données séparément

source: Table for normalization "Table"
fr: Tableau pour la normalisation « Table »

source: Select a table…
fr: Choisissez une table…

source: Table: Mode of normalization
fr: Table : mode de normalisation

source: If the value is displayed (facets, filters…), it is recommended to index label only.
fr: Si la valeur est affichée (facettes, filtres...), il est recommandé de n’indexer que le libellé.

source: Label only
fr: Libellé seul

source: Code only
fr: Code seul

source: Label and code
fr: Libellé et code

source: Table: index original value too
fr: Table : indexer également la valeur originale

source: Table: strict check (same case, same diacritics)
fr: Table : vérification stricte (même casse, mêmes diacritiques)

source: Thesaurus resources
fr: Thésaurus : ressources

source: Tops
fr: Racines

source: Self
fr: Courant

source: Broader
fr: Générique

source: Narrowers
fr: Spécifiques

source: Relateds
fr: En relation

source: Siblings
fr: Frères

source: Branch (top to descendants)
fr: Branche (de la racine aux descendants)

source: Select a type of resources
fr: Choisir le type de ressources

source: Include self
fr: Inclure lui-même

source: Values indexed
fr: Valeurs indexées

source: Resource id
fr: Id de la ressource

source: Prefered label
fr: Étiquette préférée

source: Alternative labels
fr: Étiquettes alternatives

source: Hidden labels
fr: Étiquettes cachées

source: Finalization
fr: Finalisation

source: The option "path" allows to search ascendants or descendants inside a partial of full path automatically.
fr: L’option « chemin » permet de rechercher des ascendants et des descendants dans un chemin partiel ou complet automatiquement.

source: Merge values as a path with parts separated with a "/"
fr: Fusionne les valeurs comme un chemin avec des parties séparées avec une « / »

source: comma
fr: virgule

source: semi-colon
fr: point-virgule

source: colon
fr: deux-points

source: double quote
fr: guillemet droit

source: single quote
fr: apostrophe droite

source: hash
fr: somme de contrôle

source: empty
fr: vide

source: Spreadsheet (tsv or csv)
fr: Tableur (tsv ou csv)

source: LibreOffice and tsv are recommended for compliant formats.
fr: Les formats LibreOffice et tsv sont recommandés en tant que formats standards.

source: Column delimiter
fr: Séparateur de colonne

source: A single character that will be used to separate columns in the csv file.
fr: Un caractère unique utilisé pour séparer les colonnes dans le fichier csv.

source: Column enclosure
fr: Délimiteur de colonne

source: A single character that will be used to separate columns in the csv file. The enclosure can be omitted when the content does not contain the delimiter.
fr: Un caractère unique utilisé pour séparer les colonnes dans le fichier csv. Le délimiteur peut être omis quand le contenu ne contient pas le délimiteur.

source: Solr core #{solr_core_id}: incorrect or incomplete configuration.
fr: Cœur Solr #{solr_core_id} : configuration incorrecte ou incomplète.

source: Solr core not found. Check your url.
fr: Le cœur Solr n’a pas été trouvé. Vérifiez votre url.

source: Solr core not found or unauthorized. Check your url and your credentials.
fr: Le cœur Solr est introuvable ou non autorisé. Vérifiez votre url et vos informations d’identification.

source: Solr: the config bypasses the check of the certificate.
fr: Solr : la configuration contourne la vérification du certificat.

source: OK (warning: check of certificate disabled)
fr: Ok (attention : vérification du certificat désactivée)

source: The regex for values in the solr map "{solr_map_id}" of search engine "{solr_core_name}" is invalid: {regex}
fr: La regex pour les valeurs dans l’alignement solr « {solr_map_id} » du moteur « {solr_core_name} » est incorrecte : {regex}

source: Unable to index resources in Solr core "{solr_core}". Some required fields are not mapped: {list}
fr: Impossible d’indexer les ressources dans le cœur Solr « {solr_core} ». Certains champs obligatoires ne sont pas alignés : {list}

source: Solr HTTP error: HTTP request failed due to network, limit of requests, or certificate issue. First document in the buffer: {document_id}.
fr: Erreur HTTP Solr : La requête HTTP a échoué en raison d’un problème de réseau, du nombre limite de requêtes ou de certificat. Premier document dans le tampon : {document_id}.

source: Solr HTTP error: HTTP request failed due to network, limit of requests, or certificate issue.
fr: Erreur HTTP Solr : La requête HTTP a échoué en raison d’un problème de réseau, du nombre limite de requêtes ou de certificat.

source: Indexing of {resource_name} #{id} failed: Invalid document (wrong field type or missing required field).
fr: L’indexation du {resource_name} #{id} a échoué : document non valide (mauvais type de champ ou champ obligatoire manquant).

source: Indexing of resource failed: Invalid document (wrong field type or missing required field).
fr: L’indexation de la ressource a échoué : document non valide (mauvais type de champ ou champ obligatoire manquant).

source: Indexing of {resource_name} #{id} failed: {message}
fr: L’indexation du {resource_name} #{id} a échoué : {message}

source: Indexing of the batch failed: {message}
fr: L’indexation du lot a échoué : {message}

source: Solr core is not available.
fr: Le cœur Solr n’est pas disponible.

source: This core seems to have no default field. If there are no results to a default query, add the copy field "_text_" with source "*".
fr: Ce noyau ne semble pas avoir de champ par défaut. S’il n’y a pas de résultats à une requête par défaut, ajoutez le champ de copie "_text_" avec la source "*".

source: No values have a language. The indexes will use a generic language (_txt).
fr: Aucune valeur n’a de langue. Les index utiliseront la langue générique (_txt).

source: The values use the following languages: {json}.
fr: Les valeurs utilisent les langues suivantes : {json}.

source: {count} new maps successfully created: {list}.
fr: {count} nouvelles correspondances créées avec succès : {list}.

source: Check all new maps and remove useless ones.
fr: Vérifier toutes les nouvelles correspondances et supprimer les correspondances inutiles.

source: Don’t forget to run the indexation of the core.
fr: N’oubliez pas de lancer l’indexation du cœur.

source: No new maps added.
fr: Aucune nouvelle correspondance n’a été ajoutée.

source: {count} maps successfully deleted: {list}.
fr: {count} correspondances supprimées avec succès : {list}.

source: No maps deleted.
fr: Aucune correspondance n’a été supprimée.

source: Solr map created: {solr_map_name}.
fr: Correspondance Solr créée : {solr_map_name}.

source: There was an error during validation
fr: Il y a eu une erreur durant la validation

source: Solr map modified: {solr_map_name}.
fr: Correspondance Solr modifié : {solr_map_name}.

source: Don’t forget to check search pages that use this map.
fr: N’oubliez pas de vérifier les pages de recherche qui utilisent cette correspondance.

source: Solr map
fr: Correspondance Solr

source: Solr map successfully deleted
fr: Suppression réussie de la correspondance Solr

source: Don’t forget to check search pages that used this map.
fr: N’oubliez pas de vérifier les pages de recherche qui ont utilisé cette carte.

source: Solr map could not be deleted
fr: La correspondance Solr n’a pas pu être supprimée

source: Internal id
fr: Id interne

source: Solr core "{solr_core_name}" created.
fr: Cœur Solr « {solr_core_name} » créé.

source: Solr core "{solr_core_name}" updated.
fr: Cœur Solr « {solr_core_name} » mis à jour.

source: Some required fields are missing or not available in the core: {list}. Update the generic or the resource mappings.
fr: Certains champs obligatoires sont manquants ou non disponibles dans le cœur : {list}. Mettez à jour l’alignement générique ou l’alignement des ressources.

source: Some specific static or dynamic fields are missing or not available for "{value}" in the core: {list}.
fr: Certains champs statiques ou dynamiques spécifiques sont manquants ou indisponibles pour « {value} » dans le cœur : {list}.

source: Don’t forget to reindex this core with external indexers.
fr: N’oubliez pas de ré-indexer ce noyau avec des indexeurs externes.

source: Don’t forget to reindex the resources and to check the mapping of the search pages that use this core.
fr: N’oubliez pas de ré-indexer les ressources et de vérifier les correspondances des pages de recherche qui utilisent ce cœur.

source: All indexes of core "{solr_core_name}" were deleted.
fr: Toutes les correspondances du cœur « {solr_core_name} » ont été supprimées.

source: The core "{solr_core_name}" has {count} maps. Some queries are not possible with more than 1024 indexes. You may remove indexes used to sort ("_s") or useless indexes, or group them.
fr: Le cœur "{solr_core_name}" a {count} index. Certaines requêtes ne sont pas possibles avec plus de 1024 index. Vous pouvez supprimer les index utilisés pour le tri ("_s") ou les index inutiles ou les grouper.

source: Some required fields are missing or not available in the core: {fields}. Update the generic or the resource mappings.
fr: Certains champs obligatoires sont manquants ou non disponibles dans le cœur : {fields}. Mettez à jour l’alignement générique ou l’alignement des ressources.

source: Solr core successfully deleted
fr: Suppression réussie du cœur Solr

source: Solr core could not be deleted
fr: Le cœur Solr n’a pas pu être supprimé

source: Missing file.
fr: Fichier manquant.

source: Wrong request for file.
fr: Requête du fichier incorrecte.

source: An error occurred when uploading the file.
fr: Une erreur est survenue lors du chargement du fichier.

source: Wrong media type ({media_type}) for file.
fr: Type de média incorrect ({media_type}) pour le fichier.

source: The file is empty.
fr: Le fichier est vide.

source: The file does not contain any row.
fr: Le fichier ne contient aucune ligne.

source: The headers of the file are not the default ones. Or the delimiter is not the good one according to the media-type or extension.
fr: Les en-têtes du fichier ne sont pas ceux par défaut. Ou le délimiteur n’est pas le bon en fonction du type de média ou de l’extension.

source: The row #{index} does not contain required data.
fr: La ligne #{index} ne contient pas les données obligatoires.

source: The row #{index} does not manage resource "{resource_name}".
fr: La ligne #{index} ne gère pas la ressource « {resource_name} ».

source: The file does not contain any valid data.
fr: Le fichier ne contient pas de données valides.

source: The existing mapping of core "{solr_core_name}" (#{solr_core_id}) has been deleted.
fr: La correspondance du cœur « {solr_core_name} » (#{solr_core_id}) a été supprimée.

source: An error has occurred during import of the mapping for core "{solr_core_name}" (#{solr_core_id}).
fr: Une erreur s’est produite lors de l’importation des correspondances pour le cœur « {solr_core_name} » (#{solr_core_id}).

source: {count} fields have been mapped for core "{solr_core_name}" (#{solr_core_id}).
fr: {count} champs ont été alignés pour le cœur « {solr_core_name} » (#{solr_core_id}).

source: The catchall field "_text_" already exists in core "{solr_core_name}".
fr: Le champ attrape-tout "_text_" existe déjà dans le cœur "{solr_core_name}".

source: Catchall field "_text_" created in core "{solr_core_name}". Reindex required.
fr: Le champ attrape-tout "_text_" a été créé dans le cœur "{solr_core_name}". Une réindexation est nécessaire.

source: Failed to create catchall field: {error}
fr: Impossible de créer le champ attrape-tout : {error}

source: Error creating catchall field: {error}
fr: Erreur lors de la création du champ attrape-tout : {error}

source: Solr issue: {msg}
fr: Problème Solr : {msg}

source: Generic
fr: Générique

source: Asset (attached thumbnail)
fr: Fichier (vignette jointe)

source: Item: Item set
fr: Contenu : collection

source: Item: Item sets tree
fr: Contenu : hiérarchie des collections

source: Item: Media
fr: Média attaché à un contenu

source: Item: Has media
fr: Contenu : a un média

source: Media: Content (from html or extractable text from file, included alto)
fr: Média : Contenu (html ou texte extrait depuis le fichier, notamment alto)

source: Item set: Is open
fr: Collection : ouvert

source: Value itself (in particular for module Thesaurus)
fr: Valeur elle-même (en particulier pour le module Thesaurus)

source: Value annotation appended to property
fr: Annotation de valeur attachée à une propriété

source: Access level (module Access)
fr: Niveau d’accès (module Access)

source: Selections (module Selection)
fr: Sélections (module Sélection)

source: Public selections (module Selection)
fr: Sélections publiques (module Selection)

source: Api url
fr: Url de l’api

source: Admin url
fr: URL de l’administrateur

source: Site url (default or first site only)
fr: Url du site (site par défaut ou premier site)

source: Asset/Thumbnail: file url
fr: Fichier/Vignette : url du fichier

source: Primary media: original file url
fr: Média principal : url du fichier original

source: Primary media: large thumbnail url
fr: Média principal : grande vignette url

source: Primary media: medium thumbnail url
fr: Média principal : url de la vignette moyenne

source: Primary media: square thumbnail url
fr: Média principal : vignette carrée url

source: Representative image (asset if any, else primary media large thumbnail)
fr: Image représentative (vignette spécifique le cas échéant, sinon vignette large du média principal)

source: Representative image (asset if any, else primary media medium thumbnail)
fr: Image représentative (vignette spécifique le cas échéant, sinon vignette du média principal)

source: Representative image (asset if any, else primary media square thumbnail)
fr: Image représentative (vignette spécifique le cas échéant, sinon vignette carrée du média principal)

source: Media language
fr: Langue du média

source: Media ingester
fr: Ingéreur de média

source: Media renderer
fr: Rendu du média

source: Media size
fr: Taille du fichier

source: Media source
fr: Source du média

source: File name
fr: Nom du fichier

source: Alternative text
fr: Texte alternatif

source: Asset url
fr: Url du fichier

source: Original url
fr: Url original

source: Thumbnail (asset)
fr: Vignette (fichier)

source: Property or class term
fr: Terme de propriété ou de classe

source: All property values
fr: Toutes les valeurs des propriétés

source: An issue occurred.
fr: Un problème est survenu.

source: Solr query error {url}: {message}
fr: Erreur de requête Solr {url} : {message}

source: Suggestions not implemented. Use direct URL.
fr: Les suggestions ne sont pas implémentées ici. Utilisez une url directe.

source: Could not fetch all resource ids: {message}
fr: Impossible de récupérer tous les ids des ressources : {message}

source: Search manager
fr: Moteurs de recherche

source: Field
fr: Champ

source: Set sub-property
fr: Indiquer la sous-propriété

source: Choose a field…
fr: Choisir un champ…

source: Dynamic field
fr: Champ dynamique
