Repository: Daniel-KM/Omeka-S-module-SearchSolr
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: This module requires module "{module}" version "{version}" or greater.
fr: Ce module requiert le module « {module} », version {version} ou supérieure.

source: WARNING
fr: ATTENTION

source: This will delete all search indexes (%d), all search pages (%d), and all Solr maps (%d) that use this Solr core.
fr: Cela supprimera tous les index de recherche (%d), toutes les pages de recherche (%d) et toutes les correspondances Solr (%d) qui utilisent ce cœur Solr.

source: To keep search indexes and pages, create a new core and set it for the related indexes before deletion.
fr: Pour conserver les index et les pages de recherche, créez un nouveau cœur et définissez-le pour les index concernés avant de les supprimer.

source: There is no search indexes, search pages, neither Solr maps associated with this Solr core.
fr: Il n’y a pas d’index de recherche, de pages de recherche, ni de correspondances Solr associés à ce cœur Solr.

source: Solr indexed documents
fr: Documents indexés par Solr

source: Solr indexed document
fr: Document indexé par Solr

source: Map between property "%s" and Solr field "%s" for "%s"
fr: Correspondance entre la propriété « %s » et le champ Solr « %s » pour « %s »

source: This will remove all references to this Solr map in search pages that use it (%d, of which %d are enabled for facets or sort fields).
fr: Cela supprimera toutes les références à cette correspondance Solr dans les pages de recherche qui l’utilisent (%d, dont %d sont activées pour les facettes ou les champs de tri).

source: There is no search pages associated with this Solr map.
fr: Aucune page de recherche n’est associée à cette correspondance Solr.

source: Add Solr core
fr: Ajouter un cœur Solr

source: Solr core
fr: Cœur Solr

source: Breadcrumb
fr: Fil d’Ariane

source: Solr cores
fr: Cœurs Solr

source: Add core
fr: Ajouter un cœur Solr

source: Solr admin interface, if reachable
fr: Interface d’administration de Solr, si accessible

source: Map Omeka metadata and Solr indices
fr: Voir les alignements entre les métadonnées Omeka et les index Solr

source: View indexing statistics
fr: Voir les statistiques d’indexation

source: Add new core
fr: Ajouter un nouveau cœur

source: Edit Solr core
fr: Modifier le cœur Solr

source: WARNING: Changing the required values will require a complete reindexation.
fr: ATTENTION : La modification des valeurs obligatoires nécessitera une réindexation complète.

source: About index names
fr: À propos des noms d’index

source: The indices of the default Solr configuration work with names and suffixes matching type:
fr: Les index de la configuration par défaut de Solr fonctionnent avec des suffixes correspondant au type :

source: "_t" and "_txt" are used to store words individually.
fr: « _t » et « _txt » sont utilisés pour enregistrer les mots individuellement.

source: "_s" and "_ss" are used to store whole string.
fr: « _s » et « _ss » sont utilisés pour enregistrer les chaînes complètes.

source: "_i" and "_is" are used to store integers.
fr: « _i » et « _is » sont utilisés pour enregistrer les nombres entiers.

source: "_dt" and "_dts" are used to store dates.
fr: « _dt » et « _dts » sont utilisés pour enregistrer les dates.

source: "_ancestor_path" and "_descendent_path" are used to store structures.
fr: « _ancestor_path » et « _descendent_path » sont utilisés pour enregistrer des arborescences.

source: The choice of type depends on what you need for a metadata:
fr: Le choix du type dépend de ce que vous voulez faire pour les métadonnées :

source: For global searches, indices should be "_t" and "_txt".
fr: Pour la recherche globale, les index doivent être « _t » et « _txt ».

source: For simple filters and facets, indices should be a multiple whole values ("_ss", "_is" and "_dts").
fr: Pour les filtres simples et les facettes, les index doivent être des valeurs multiples (« _ss », « _is » et « _dts »).

source: For sort, it should be a single value ("_s", "_i" and "_dt").
fr: Pour le tri, les index doivent être une valeur unique (« _s », « _i » et « _dt »).

source: For bounce links, it should be multiple values formatted for linking ("_link_ss").
fr: Les liens rebonds doivent être formattés pour multiple valeurs ("_link_ss").

source: "_ancestor_path" and "_descendent_path" are generally used for search and facets, generally with a thesaurus, a classification scheme, or geographic names.
fr: « _ancestor_path » et « _descendent_path » sont généralement utilisés pour la recherche et les facettes, généralement avec un thésaurus, un plan de classement ou des noms géographiques.

source: Other indices are available for complex cases. Solr should be configured first if more types are needed.
fr: D’autres index sont disponibles pour les cas complexes. Solr doit être configuré si d’autres types sont nécessaires.

source: Import mapping
fr: Importer des correspondances

source: Export maps for easier spreadsheet mapping.
fr: Exporter les correspondances pour faciliter l’alignement à l’aide d’un tableur.

source: Export mapping
fr: Export de l’alignement

source: Warning: To import a mapping will reset the current mapping for all resources of the core. It is recommended to export it first.
fr: Attention : l’import des correspondances réinitialise l’alignement actuel pour toutes les ressources du cœur. Il est recommandé de l’exporter d’abord.

source: The form should be a spreadsheet with the same headers than the export ones.
fr: Le formulaire doit être un tableur avec les mêmes en-têtes que ceux de l’export.

source: Total non-indexed %1$s (%2$s): %3$d
fr: Total non-indexé %1$s (%2$s) : %3$d

source: Total indexed %1$s (%2$s): %3$d
fr: Total indexés %1$s (%2$s) : %3$d

source: Total indexed values: %d
fr: Total des valeurs indexées : %d

source: By resource
fr: Par ressource

source: List indexed resources
fr: Lister les ressources indexées

source: List non-indexed resources
fr: Lister les ressources non-indexées

source: %1$s: %2$d indexed / %3$d = %4$d (too many or indexed multiple times)
fr: %1$s : %2$d indexés / %3$d = %4$d (trop ou indexés plusieurs fois)

source: %1$s: %2$d indexed / %3$d = %4$d (missing)
fr: %1$s : %2$d indexés / %3$d = %4$d (manquants)

source: %1$s: %2$d indexed / %3$d (all)
fr: %1$s : %2$d indexés / %3$d (tous)

source: Maps
fr: Alignements

source: Add a map
fr: Ajouter une correspondance

source: Map all
fr: Tout aligner

source: Add indices (_txt, _ss, _s) to all missing and used properties.
fr: Ajouter les index manquants (_txt, _ss, s) pour les propriétés utilisées.

source: Remove unused
fr: Supprimer inutilisés

source: Remove maps of properties that are not used.
fr: Supprimer les correspondances des propriétés qui ne sont pas utilisées.

source: Import maps. Warning: it will reset the current mapping for all resources. It is recommended to export it first.
fr: Importer des correspondances. Attention : cette opération réinitialise les correspondances en cours de toutes les ressources. Il est recommandé de les exporter d’abord.

source: Create _text_
fr: Créer _text_

source: Create the catchall copyField "_text_" for optimized full-text search. Reindexing will be required.
fr: Créer le champ attrape-tout "_text_" (copyField) pour une recherche plein-texte optimisée. Une réindexation sera nécessaire.

source: By index
fr: Par index

source: Pool / Filter
fr: Entrepôt / Filtre

source: List indexed values alphabetically
fr: Lister les valeurs indexées par ordre alphabétique

source: List indexed values alphabetically (reverse)
fr: Lister les valeurs indexées par ordre alphabétique inverse

source: List indexed values by count
fr: Lister les valeurs indexées par total

source: List indexed values by count (reverse)
fr: Lister les valeurs indexées par total (inverse)

source: Filtered by values
fr: Filtré par les valeurs

source: Filtered by uris
fr: Filtré par uris

source: Filtered by resources
fr: Filtré par les ressources

source: Filtered by value resources
fr: Filtré par les ressources des valeurs

source: Excluded data types
fr: Types de données exclues

source: Only languages
fr: Seulement les langues

source: Filtered by visibility Public
fr: Filtré par visibilité Public

source: Filtered by visibility Private
fr: Filtré par visibilité Privé

source: Add index
fr: Ajouter un index

source: Indices
fr: Index

source: Solr indices
fr: Index Solr

source: Add new map
fr: Ajouter une correspondance

source: Add a text index to all missing and used properties.
fr: Ajouter une correspondance texte pour toutes les propriétés utilisées qui n’en ont pas.

source: Map all used properties
fr: Aligner toutes les propriétés utilisées

source: Remove unused properties
fr: Supprimer les propriétés inutilisées

source: Indices for "%s"
fr: Index pour « %s »

source: There is no maps defined yet.
fr: Aucune correspondance n’a encore été définie.

source: Add a new map
fr: Ajouter une correspondance

source: Edit index
fr: Modifier l’index

source: Fill index with metadata from a type of resource
fr: Remplir l’index avec les métadonnées d’un type de ressource

source: Metadata to extract from Omeka
fr: Métadonnée à extraire depuis Omeka

source: Adapt the metadata
fr: Adapter les métadonnées

source: You should reindex your Solr cores.
fr: Vous devez réindexer vos cœurs Solr.

source: Now, values can be indexed differently for each data type, if wanted.
fr: Désormais, les valeurs peuvent être indexées différemment pour chaque type de données, si on le souhaite.

source: Use the new import/export tool to simplify config.
fr: Utilisez le nouvel outil d’import/export pour simplifier la configuration.

source: This module requires the module "{module}", version {version} or above.
fr: Ce module requiert le module « {module} », version {version} ou supérieure.

source: The auto-suggestion requires a specific url for now.
fr: L’auto-suggestion nécessite une url spécifique pour l’instant.

source: The resource types are now structured to simplify config: "generic" and "resource" allow to set mapping for any resource.
fr: Les types de ressources sont désormais structurés pour simplifier la configuration : « générique » et « ressource » permettent de définir les correspondances pour toutes les ressource.

source: All mapping for items and item sets have been copied to resources.
fr: Toutes les correspondances pour les éléments et les ensembles d’éléments ont été copiées dans les ressources.

source: It is recommended to check mappings, to remove the useless and duplicate ones, and to run a full reindexation.
fr: Il est recommandé de vérifier les correspondances, de supprimer celles inutiles ou en double et de lancer une réindexation complète.

source: It is now possible to index original and thumbnails urls.
fr: Il est désormais possible d’indexer les urls des fichiers originaux et des vignettes.

source: It is now possible to filter values to index via a regex, a list of languages or a visibility.
fr: Il est désormais possible de filtrer les valeurs à indexer via une expression rationnelle, une liste de langues ou une visibilité.

source: It is now possible to filter resources to index, for example an item set, a template, an owner, a visibility, etc.
fr: Il est désormais possible de filtrer les ressources à indexer, par exemple une collection, un modèle, un propriétaire, une visibilité, etc.

source: It is now possible to use module Table to manage tables for normalization of indexation.
fr: Il est désormais possible d’utiliser le module Table pour gérer les tables de normalisation de l’indexation.

source: The table used for indexation has been converted into a standard {link}table{link_end}. It is recommended to remove the old one from the config.
fr: La table utilisée pour l’indexation a été convertie en une {link}table{link_end} standard. Il est recommandé de supprimer l’ancienne table de la configuration.

source: The support of module Access Resource has been removed. Support of module Access has been added.
fr: La prise en charge du module Access Resource a été supprimée. Le module Access est désormais pris en charge.

source: A reindexing is needed.
fr: Une réindexation est nécessaire.

source: You should remove key "table" from the file config/local.config.php before upgrading.
fr: Vous devez supprimer la clé « table » du fichier config/local.config.php avant la mise à jour.

source: It is now possible to list {link}all resources and values indexed by a core{link_end}.
fr: Il est désormais possible de lister {link}toutes les ressources et valeurs indexés dans un cœur{link_end}.

source: The list of formats was simplified.
fr: La liste des formats a été simplifiée.

source: It is now possible to do exact search with query wrapped with double quotes.
fr: Il est désormais possible de faire une recherche exacte avec une requête entre guillemets droits.

source: The management of indices has been merged in a {link}single page{link_end}.
fr: La gestion des index a été fusionnée dans une {link}page simple{link_end}.

source: Some solr map fields were renamed: {json}.
fr: Certains champs solr on été renommés : {json}.

source: It is now possible to set a default alias for each omeka/solr map. Common aliases were added, for example "id" for "o:id" and "item_set_id" for "item_set_id_is".
fr: Il est désormais possible de définir un alias par défaut pour chaque correspondance omeka/solr. Les alias courants ont été ajoutés, par exemple « id » pour « o:id » et « item_set_id » pour « item_set_id_is ».

source: Property terms can be used as dynamic aliases when an index exists for them.
fr: Les termes de propriété peuvent être utilisés comme alias dynamiques quand un index existe.

source: A {link}config form{link_end} was added to specify the use of php-curl if wanted and the solarium timeout.
fr: La {link}configuration{link_end} permet désormais d’indiquer si php-curl doit être utilisé ainsi que la durée de connexion via solarium.

source: The button {link}Map all{link_end} creates new indexes for languages.
fr: Le bouton {link}Tout aligner{link_end} crée de nouveaux index par langue.

source: The default option "auto" for format of indexed values was replaced by "main". A new option "full" now include the uri and the linked resource id. You should check your indices, filters and facets.
fr: L’option par défaut "auto" pour le format des valeurs indexées a été remplacée par "principal". Une nouvelle option "Tout" inclue désormais l’uri et l’id de la ressource liée. Vous devez vérifier vos index, filtres et facettes.

source: It is now possible to index the label of uri and linked resource.
fr: Il est désormais possible d’indexer les libellés des uris et des ressources liées.

source: It is now possible to specify a boost for selected indexes.
fr: Il est désormais possible de définir une pondération pour chaque index.

source: The statistics about index were moved to a specific page.
fr: Les statistiques pour les index ont été déplacées sur une nouvelle page.

source: The performance was improved for indexing and querying. Warning: It is no more possible to query with any diacritics on static fields like _ss.
fr: La performance a été améliorée pour l’indexation et l’interrogation. Attention : il n’est plus possible de faire une recherche avec des diacritiques sur les champs statiques comme _ss.

source: The composer library "{library}" is not installed. See readme.
fr: La bibliothèque composer « {library} » n’est pas installée. Voir le lisez-moi.

source: The default core can be configured in the %1$ssearch manager%2$s.
fr: Le cœur par défaut peut être configuré dans les %1$smoteurs de recherche%2$s.

source: The value "{value}" cannot be included in a path. The "/" is replaced by " - ".
fr: La valeur « {value} » ne peut pas être inclue dans un chemin. La « / » est remplacé par un « - ».

source: For formatter "Table", the table is not set.
fr: Pour le formateur « Table », la table n’est pas définie.

source: For formatter "Table", the table #{table_id} does not exist and values are not normalized.
fr: Pour le formateur « Table », la table #{table_id} n’existe pas et les valeurs ne seront pas normalisées.

source: Thesaurus
fr: Thésaurus

source: Get the resource ids or labels from thesaurus (module Thesaurus)
fr: Récupère les identifiants ou les étiquettes des concepts du thésaurus (module Thésaurus)

source: Integer
fr: Entier

source: Convert string into integer
fr: Convertir une chaîne en entier

source: Check and get date and time
fr: Vérifier et convertir en date et heure

source: Create a geographic point from data types geometry, geography and place (modules Data Type Geometry and Data Type Place)
fr: Créer un point géographique à partir des types de données geometry, geography et place (modules Data Type Geometry et Data Type Place)

source: Get the value and normalize
fr: Prendre la valeur et normaliser

source: Place
fr: Lieu

source: Store country and toponym from a value of type place (module Data Type Place)
fr: Enregistrer le pays et le toponyme à partir d’une valeur de type place (module Data Type Place)

source: Boolean
fr: Booléen

source: Convert value into boolean true or false
fr: Convertir la valeur en booléen vrai ou faux

source: Date range
fr: Intervalle de date

source: Date range from two dates separated with a "/".
fr: Intervalle de date avec deux dates séparées avec une « / ».

source: Solr core is not available. Check config or certificate to get Solr core schema {url}.
fr: Le cœur Solr n’est pas disponible. Vérifier la configuration ou le certificat pour obtenir le schéma du cœur Solr {url}.

source: Solr core is not available. Check config to get Solr core schema {url}.
fr: Le cœur Solr n’est pas disponible. Vérifier la configuration pour obtenir le schéma du cœur Solr {url}.

source: Response is not valid. Check output of {url}, that should be valid json data.
fr: La réponse n’est pas valide. Vérifiez la sortie de {url}, qui devrait être une donnée json valide.

source: Response is not valid. Check output of {url}, that should be a json with a key "schema".
fr: La réponse n’est pas valide. Vérifiez la sortie de {url}, qui devrait être un json avec une clé « schéma ».

source: Solarium adapter
fr: Adapteur Solarium

source: Auto (curl when available)
fr: Auto (curl si disponible)

source: Curl (via extension php-curl)
fr: Curl (via l’extension php-curl)

source: Curl (unavailable: require extension php-curl)
fr: Curl (indisponible : nécessite l’extension php-curl)

source: Solarium timeout (seconds)
fr: Délai d’expiration Solarium (secondes)

source: Select a metadata from the resource…
fr: Choisir une métadonnée dans la ressource…

source: Sub-property
fr: Sous-propriété

source: Scheme
fr: Schéma

source: IP or hostname
fr: IP ou hôte

source: Is secure
fr: Est sécurisé

source: Solr user
fr: Utilisateur Solr

source: Solr password
fr: Mot de passe Solr

source: Note: the password is saved clear in the database, so it is recommended to create a specific user.
fr: Note : le mot de passe est enregistré en clair dans la base de données. Il est donc recommandé de créer un utilisateur spécifique.

source: Bypass certificate check
fr: Ignorer le contrôle du certificat

source: Avoid issue when the certificate expires.
fr: Évite un problème lorsque le certificat expire.

source: Http request type
fr: Type de requête Http

source: Choose if requests to Solr use "get" or "post".
fr: Choisissez si les demandes adressées à Solr utilisent « get » ou « post ».

source: Post (allow big queries and numerous facets)
fr: Post (permet des requêtes importantes et de nombreuses facettes)

source: Get (cacheable)
fr: Get (cachable)

source: Filter resources to index with a specific query
fr: Filtrer les ressources à indexer avec une requête spécifique

source: Allow to store only an item set, a template, an owner, a visibility, etc.
fr: Permet de stocker uniquement un ensemble d’éléments, un modèle, un propriétaire, une visibilité, etc.

source: Index specific fields
fr: Indexer les champs spécifiques

source: Allow to store specific data needed to share a core with a third party. All field names should be manually adapted.
fr: Permet de stocker des données spécifiques nécessaires au partage d’un noyau avec un tiers. Tous les noms de champs doivent être adaptés manuellement.

source: Server id for shared core
fr: Identifiant du serveur pour le cœur partagé

source: May be empty, or may be or may not be the same unique id than the third party, depending on its configuration. For information, the unique id of the install is "%s".
fr: Peut être vide ou peut être ou ne pas être le même identifiant unique que le tiers en fonction de sa configuration. Pour information, l’identifiant unique de l’installation est « %s ».

source: Resource languages 2-letters iso codes for shared core
fr: Codes des langues des ressources iso à 2 lettres pour le cœur partagé

source: A third party may need to know the languages of a resource, even if it has no meaning in Omeka. Use "und" for undetermined.
fr: Un outil tiers peut avoir besoin de connaître la langue d’une ressource, même si cela n’a pas de sens dans Omeka. Utiliser "und" pour indéterminé.

source: Clear all indexes, included external ones
fr: Effacer tous les index, y compris les index externes

source: Warning: this button will clear all indexes on the core, included indexes externally managed if multi-index is set.
fr: Attention : ce bouton effacera tous les index du cœur, y compris les index gérés en externe si le multi-index est activé.

source: Minimum match (or/and)
fr: Correspondance minimale (ou/et)

source: Integer "1" means "OR", "100%" means "AND". Complex expressions are possible, like "3<80%". If empty, the config of the solr core (solrconfig.xml) will be used.
fr: Le nombre « 1 » signifie « OR » et « 100% » signifie « AND ». Les expressions complexes sont possibles, comme « 3<80% ». Si vide, la configuration du cœur Solr (solrconfig.xml) sera utilisée.

source: Tie breaker
fr: Rupture d’égalité

source: Increase score according to the number of matched fields. If empty, the config of the solr core (solrconfig.xml) will be used.
fr: Augmente le score en fonction du nombre de champs correspondants. Si vide, la configuration du cœur Solr (solrconfig.xml) sera utilisée.

source: Solr index name for shared core
fr: Nom de l’index Solr pour le cœur partagé

source: May be empty, or may be or may not be the same index name than the third party, depending on its configuration.
fr: Peut être vide ou peut être ou ne pas être le même nom d’index que le tiers en fonction de sa configuration.

source: {label} (unavailable: option multi-index not set)
fr: {label} (indisponible : l’option multi-index n’est pas spécifiée)

source: Scope
fr: Portée

source: To select a sub-property allows to store a linked metadata when the property is filled with a resource. Thereby, an item can be found from the specified value of a linked item. For example an issue of a journal can be linked with the journal, so the issue can be found from the title of the journal.
fr: La sélection d’une sous-propriété permet de stocker une métadonnée liée lorsque la propriété contient une ressource. Ainsi, un contenu peut être trouvé à partir de la valeur spécifiée d’un contenu lié. Par exemple, un numéro d’une revue peut être lié à la revue, de sorte que le numéro peut être trouvé à partir du titre de la revue.

source: Only these data types
fr: Seulement ces types de données

source: Only values of resources matching this standard query
fr: Seulement les valeurs des ressources correspondant à cette requête standard

source: Only values matching this regex
fr: Seulement les valeurs correspondant à cette expression rationnelle
